import random

def task_1():
    print("Задача 1: Определение скорости.Напишите программу, которая запрашивает у пользователя расстояние в километрах и время в часах, а затем вычисляет и выводит скорость в километрах в час (км/ч).")

def task_2():
    print("Задача 2: Определение массы. Напишите программу, которая запрашивает у пользователя силу в ньютонах и ускорение в метрах на секунду в квадрате, а затем вычисляет и выводит массу в килограммах.")

def task_3():
    print("Задача 3: Определение температуры по Цельсию. Напишите программу, которая запрашивает температуру в градусах Фаренгейта и переводит её в градусы Цельсия.")

def task_4():
    print("Задача 4: Определение работы. Напишите программу, которая запрашивает силу в ньютонах и расстояние в метрах, а затем вычисляет и выводит работу в джоулях.")

def task_5():
    print("Задача 5: Определение кинетической энергии. Напишите программу, которая запрашивает у пользователя массу объекта в килограммах и его скорость в метрах в секунду, а затем вычисляет и выводит кинетическую энергию в джоулях.")

def task_6():
    print("Задача 6: Определение потенциальной энергии. Напишите программу, которая запрашивает у пользователя массу в килограммах, высоту в метрах и значение ускорения свободного падения, затем вычисляет и выводит потенциальную энергию в джоулях.")

def task_7():
    print("Задача 7: Определение давления. Напишите программу, которая запрашивает у пользователя силу в ньютонах и площадь в квадратных метрах, а затем вычисляет и выводит давление в паскалях.")

def task_8():
    print("Задача 8: Определение теплоты. Напишите программу, которая запрашивает у пользователя массу в килограммах, удельную теплоёмкость и изменение температуры в градусах Цельсия, а затем вычисляет и выводит количество теплоты.")

def task_9():
    print("Задача 9: Определение частоты. Напишите программу, которая запрашивает у пользователя период колебаний в секундах, а затем вычисляет и выводит частоту в герцах.")

def task_10():
    print("Задача 10: Определение объема. Напишите программу, которая запрашивает у пользователя радиус основания и высоту цилиндра, а затем вычисляет и выводит объем цилиндра.")

tasks = [task_1, task_2, task_3, task_4, task_5, task_6, task_7, task_8, task_9, task_10]

print("Программа случайного выбора задачи. Введите 'q' для выхода.")

while True:
    user_input = input("Нажмите Enter для выбора случайной задачи или 'q' для выхода: ")
    if user_input == 'q':
        print("Выход из программы.")
        break

    selected_task = random.choice(tasks)
    selected_task() 
